espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/wlan_bt_ble/wlan_https_bt_a2dp_ble_dual_role/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_clock.h
    kCLOCK_HsGpio0 = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 0),
    kCLOCK_HsGpio1 = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 1),
    kCLOCK_HsGpio2 = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 2),
    kCLOCK_HsGpio3 = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 3),
    kCLOCK_HsGpio4 = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 4),
    kCLOCK_HsGpio5 = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 5),
    kCLOCK_HsGpio6 = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 6),
    kCLOCK_HsGpio7 = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 7),
    kCLOCK_Crc     = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 16),
    kCLOCK_Dmac0   = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 23),
    kCLOCK_Dmac1   = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 24),
    kCLOCK_Mu      = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 28),
    kCLOCK_Sema    = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 29),
    kCLOCK_Freqme  = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 31),

    kCLOCK_Ct32b0   = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL2, 0),
    kCLOCK_Ct32b1   = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL2, 1),
    kCLOCK_Ct32b2   = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL2, 2),
    kCLOCK_Ct32b3   = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL2, 3),
    kCLOCK_Ct32b4   = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL2, 4),
    kCLOCK_Rtc      = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL2, 7),
    kCLOCK_Mrt0     = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL2, 8),
    kCLOCK_Wwdt1    = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL2, 10),
    kCLOCK_I3c0     = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL2, 16),
    kCLOCK_I3c1     = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL2, 17),
    kCLOCK_Pint     = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL2, 30),
    kCLOCK_InputMux = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL2, 31)
} clock_ip_name_t;

/*! @brief Clock name used to get clock frequency. */
typedef enum _clock_name
{
    kCLOCK_CoreSysClk,       /*!< Core clock  (aka HCLK)                                 */
    kCLOCK_BusClk,           /*!< Bus clock (AHB/APB clock, aka HCLK)                    */
    kCLOCK_MclkClk,          /*!< MCLK, to MCLK pin                                      */
    kCLOCK_ClockOutClk,      /*!< CLOCKOUT                                               */
    kCLOCK_AdcClk,           /*!< ADC                                                    */
    kCLOCK_Flexspi0Clk,      /*!< FlexSpi0                                               */
    kCLOCK_Flexspi1Clk,      /*!< FlexSpi1                                               */
    kCLOCK_SctClk,           /*!< SCT                                                    */
    kCLOCK_Wdt0Clk,          /*!< Watchdog0                                              */
    kCLOCK_Wdt1Clk,          /*!< Watchdog1                                              */
    kCLOCK_SystickClk,       /*!< Systick                                                */
    kCLOCK_Sdio0Clk,         /*!< SDIO0                                                  */
    kCLOCK_Sdio1Clk,         /*!< SDIO1                                                  */
    kCLOCK_I3cClk,           /*!< I3C0 and I3C1                                          */
    kCLOCK_UsbClk,           /*!< USB0                                                   */
    kCLOCK_DmicClk,          /*!< Digital Mic clock                                      */
    kCLOCK_DspCpuClk,        /*!< DSP  clock                                             */
    kCLOCK_AcmpClk,          /*!< Acmp clock                                             */
    kCLOCK_Flexcomm0Clk,     /*!< Flexcomm0Clock                                         */
    kCLOCK_Flexcomm1Clk,     /*!< Flexcomm1Clock                                         */
    kCLOCK_Flexcomm2Clk,     /*!< Flexcomm2Clock                                         */
    kCLOCK_Flexcomm3Clk,     /*!< Flexcomm3Clock                                         */
    kCLOCK_Flexcomm4Clk,     /*!< Flexcomm4Clock                                         */
    kCLOCK_Flexcomm5Clk,     /*!< Flexcomm5Clock                                         */
    kCLOCK_Flexcomm6Clk,     /*!< Flexcomm6Clock                                         */
    kCLOCK_Flexcomm7Clk,     /*!< Flexcomm7Clock                                         */
    kCLOCK_Flexcomm8Clk,     /*!< Flexcomm8Clock                                         */
    kCLOCK_Flexcomm9Clk,     /*!< Flexcomm9Clock                                         */
    kCLOCK_Flexcomm10Clk,    /*!< Flexcomm10Clock                                        */
    kCLOCK_Flexcomm11Clk,    /*!< Flexcomm11Clock                                        */
    kCLOCK_Flexcomm12Clk,    /*!< Flexcomm12Clock                                        */
    kCLOCK_Flexcomm13Clk,    /*!< Flexcomm13Clock                                        */
    kCLOCK_Flexcomm14Clk,    /*!< Flexcomm14Clock                                        */
    kCLOCK_Flexcomm15Clk,    /*!< Flexcomm15Clock                                        */
    kCLOCK_Flexcomm16Clk,    /*!< Flexcomm16Clock                                        */
    kCLOCK_FlexioClk,        /*!< FlexIO                                                 */
    kCLOCK_GpuClk,           /*!< GPU Core                                               */
    kCLOCK_DcPixelClk,       /*!< DCNano Pixel Clock                                     */
    kCLOCK_MipiDphyClk,      /*!< MIPI D-PHY Bit Clock                                   */
    kCLOCK_MipiDphyEscRxClk, /*!< MIPI D-PHY RX Clock                                    */
    kCLOCK_MipiDphyEscTxClk, /*!< MIPI D-PHY TX Clock                                    */
} clock_name_t;

/**
 * PLL PFD clock name
 */
typedef enum _clock_pfd
{
    kCLOCK_Pfd0 = 0U, /*!< PLL PFD0 */
    kCLOCK_Pfd1 = 1U, /*!< PLL PFD1 */
    kCLOCK_Pfd2 = 2U, /*!< PLL PFD2 */
    kCLOCK_Pfd3 = 3U, /*!< PLL PFD3 */
} clock_pfd_t;

/*! @brief Clock Mux Switches
 *  The encoding is as follows each connection identified is 32bits wide
 *  starting from LSB upwards
 *
 *  [    31             30              29:28        27:25         24:14        13:11          10:0    ]
 *  [CLKCTL index]:[FRODIVSEL onoff]:[FRODIVSEL]:[MUXB choice]:[MUXB offset]:[MUXA choice]:[MUXA offset]
 *  FRODIVSEL onoff '1' means need to set FRODIVSEL. MUX offset 0 means end of descriptor.
 */
/* CLKCTL0 SEL */
#define SYSPLL0CLKSEL_OFFSET 0x200
#define MAINCLKSELA_OFFSET 0x430
#define MAINCLKSELB_OFFSET 0x434
#define FLEXSPI0FCLKSEL_OFFSET 0x620
#define FLEXSPI1FCLKSEL_OFFSET 0x630
#define SCTFCLKSEL_OFFSET 0x640
#define USBHSFCLKSEL_OFFSET 0x660
#define SDIO0FCLKSEL_OFFSET 0x680
#define SDIO1FCLKSEL_OFFSET 0x690
#define ADC0FCLKSEL0_OFFSET 0x6D0
#define ADC0FCLKSEL1_OFFSET 0x6D4
#define UTICKFCLKSEL_OFFSET 0x700
#define WDT0FCLKSEL_OFFSET 0x720
#define A32KHZWAKECLKSEL_OFFSET 0x730
#define SYSTICKFCLKSEL_OFFSET 0x760
#define DPHYCLKSEL_OFFSET 0x770
#define DPHYESCCLKSEL_OFFSET 0x778
#define GPUCLKSEL_OFFSET 0x790
#define DCPIXELCLKSEL_OFFSET 0x7A0
/* CLKCTL1 SEL */
#define AUDIOPLL0CLKSEL_OFFSET 0x200
#define DSPCPUCLKSELA_OFFSET 0x430
#define DSPCPUCLKSELB_OFFSET 0x434
#define OSEVENTTFCLKSEL_OFFSET 0x480
#define FC0FCLKSEL_OFFSET 0x508
#define FC1FCLKSEL_OFFSET 0x528
#define FC2FCLKSEL_OFFSET 0x548
#define FC3FCLKSEL_OFFSET 0x568
#define FC4FCLKSEL_OFFSET 0x588
#define FC5FCLKSEL_OFFSET 0x5A8
#define FC6FCLKSEL_OFFSET 0x5C8
#define FC7FCLKSEL_OFFSET 0x5E8
#define FC8FCLKSEL_OFFSET 0x608
#define FC9FCLKSEL_OFFSET 0x628
#define FC10FCLKSEL_OFFSET 0x648
#define FC11FCLKSEL_OFFSET 0x668
#define FC12FCLKSEL_OFFSET 0x688
#define FC13FCLKSEL_OFFSET 0x6A8
#define FC14FCLKSEL_OFFSET 0x6C8
#define FC15FCLKSEL_OFFSET 0x6E8
#define FC16FCLKSEL_OFFSET 0x708
#define FLEXIOCLKSEL_OFFSET 0x728
#define DMIC0FCLKSEL_OFFSET 0x780
#define CT32BIT0FCLKSEL_OFFSET 0x7A0
#define CT32BIT1FCLKSEL_OFFSET 0x7A4
#define CT32BIT2FCLKSEL_OFFSET 0x7A8
#define CT32BIT3FCLKSEL_OFFSET 0x7AC
#define CT32BIT4FCLKSEL_OFFSET 0x7B0
#define AUDIOMCLKSEL_OFFSET 0x7C0
#define CLKOUTSEL0_OFFSET 0x7E0
#define CLKOUTSEL1_OFFSET 0x7E4
#define I3C01FCLKSEL_OFFSET 0x800
#define I3C01FCLKSTCSEL_OFFSET 0x804
#define I3C01FCLKSTSTCLKSEL_OFFSET 0x814
#define WDT1FCLKSEL_OFFSET 0x820
#define ACMP0FCLKSEL_OFFSET 0x830
/* CLKCTL0 DIV */
#define LOWFREQCLKDIV_OFFSET 0x130
#define SYSCPUAHBCLKDIV_OFFSET 0x400
#define PFC0CLKDIV_OFFSET 0x500
#define PFC1CLKDIV_OFFSET 0x504
#define FLEXSPI0FCLKDIV_OFFSET 0x624
#define FLEXSPI1FCLKDIV_OFFSET 0x634
#define SCTFCLKDIV_OFFSET 0x644
#define USBHSFCLKDIV_OFFSET 0x664
#define SDIO0FCLKDIV_OFFSET 0x684
#define SDIO1FCLKDIV_OFFSET 0x694
#define ADC0FCLKDIV_OFFSET 0x6D8
#define A32KHZWAKECLKDIV_OFFSET 0x734
#define SYSTICKFCLKDIV_OFFSET 0x764
#define DPHYCLKDIV_OFFSET 0x774
#define DPHYESCRXCLKDIV_OFFSET 0x77C
#define DPHYESCTXCLKDIV_OFFSET 0x780
#define GPUCLKDIV_OFFSET 0x794
#define DCPIXELCLKDIV_OFFSET 0x7A4
/* CLKCTL1 DIV */
#define AUDIOPLLCLKDIV_OFFSET 0x240
#define DSPCPUCLKDIV_OFFSET 0x400
#define FLEXIOCLKDIV_OFFSET 0x740
#define FRGPLLCLKDIV_OFFSET 0x760
#define DMIC0FCLKDIV_OFFSET 0x784
#define AUDIOMCLKDIV_OFFSET 0x7C4
#define CLKOUTFCLKDIV_OFFSET 0x7E8
#define I3C01FCLKSTCDIV_OFFSET 0x808
#define I3C01FCLKSDIV_OFFSET 0x80C
#define I3C01FCLKDIV_OFFSET 0x810
#define ACMP0FCLKDIV_OFFSET 0x834

